{
  "_class_name": "UNet2DModel",
  "_diffusers_version": "0.14.0",
  "_name_or_path": "models/DiffusionCond/112_3_mse/unet",
  "act_fn": "silu",
  "add_attention": true,
  "attention_head_dim": 8,
  "block_out_channels": [
    128,
    128,
    256
  ],
  "center_input_sample": false,
  "class_embed_type": "timestep",
  "down_block_types": [
    "DownBlock2D",
    "AttnDownBlock2D",
    "DownBlock2D"
  ],
  "downsample_padding": 1,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 1,
  "layers_per_block": 3,
  "mid_block_scale_factor": 1,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "num_class_embeds": 62,
  "out_channels": 1,
  "resnet_time_scale_shift": "default",
  "sample_size": 16,
  "time_embedding_type": "positional",
  "up_block_types": [
    "UpBlock2D",
    "AttnUpBlock2D",
    "UpBlock2D"
  ]
}
